blog/app/controllers/articles_controller.rb

  def create
    @article = Article.new (params[:article])

    if @article.save
---
INSERT INTO "articles" ("created_at", "title", "body", "updated_at", "published") VALUES('2010-04-09 17:57:46', '<', 'jfjfjf', '2010-04-09 17:57:46', 'f')

  def show
    @article = Article.find(params[:id])
    @comment = @article.comments.build
    @comments = @article.comments.all
---
SELECT * FROM "articles" WHERE ("articles"."id" = 0)
SELECT * FROM "comments" WHERE ("comments".article_id = 3)

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)