blog/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.build(params[:comment])

    if @comment.save
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)
INSERT INTO "comments" ("created_at", "body", "updated_at", "article_id") VALUES('2010-04-09 20:10:28', 'sdfsdfd', '2010-04-09 20:10:28', 3)